app/controllers/scores_controller.rb

  def create
    @score = Score.new(score_params)

    if @score.save
---
INSERT INTO "scores" ("name", "time", "created_at", "updated_at", "level") VALUES (?, ?, ?, ?, ?)  [["name", nil], ["time", 0], ["created_at", "2022-10-16 09:08:46.563718"], ["updated_at", "2022-10-16 09:08:46.563718"], ["level", nil]]

    def set_score
      @score = Score.find(params[:id])
---
SELECT "scores".* FROM "scores" WHERE "scores"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]